In [1]:
import pandas as pd
from pyquery import DataBase

In [2]:
employee = pd.DataFrame({
    "emp_id": [1, 2, 3, 4, 5, 6],
    "name": ["a", "b", "c", "d", "e", "f"],
    "gender": ["M", "F", "M", "F", "M", "F"]
})
DB = DataBase(database={"employee": employee})

In [3]:
query = """
select
    emp_id,
    name
from
    employee
where
    gender = "F"
;
"""
DB.run(query)

   EMP_ID NAME
0       2    b
1       4    d
2       6    f

In [6]:
DB.run(query)

   EMP_ID NAME GENDER
0       2    b      F
1       4    d      F
2       6    f      F